# Import Modules

In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [5]:
n_rows =10
n_cols= 5
cols=tuple('ABCDE')
df= pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0   8  19   3   5   5
1  14  12   9  15   6
2  16   4  13   8  17
3  11   9  12   2   5
4  10   6  13  11   7
5   4  19  17   2   1
6  12  13   7  19   2
7  11  18  15   3  12
8   3  14   6   9  13
9   5  13  16  10  13

# Seleksi kolom dan baris menggunakan loc

In [9]:
df.loc[[0,3,4],['B','E']]

    B  E
0  19  5
3   9  5
4   6  7

# Seleksi baris dengan kondisi

In [11]:
df.loc[df['B']>10,['B','D','E']]

    B   D   E
0  19   5   5
1  12  15   6
5  19   2   1
6  13  19   2
7  18   3  12
8  14   9  13
9  13  10  13

# Slicing Data Frame dengan loc

In [13]:
df.loc[0:4,'B':'D']

    B   C   D
0  19   3   5
1  12   9  15
2   4  13   8
3   9  12   2
4   6  13  11